[
    {
        "id": 1,
        "title": "Saga des Saiyans",
        "summary": "Les guerriers Saiyans envahissent la Terre, obligeant Goku et ses amis à se battre contre Nappa et Vegeta.",
        "content": "<p>La Saga des Saiyans commence avec l'arrivée de Raditz, le frère de Goku, qui révèle à ce dernier ses origines Saiyanes. Après un combat intense, Raditz est tué, mais pas avant d'avoir envoyé un message à Vegeta et Nappa, deux autres Saiyans, les informant de la présence de puissants guerriers sur Terre. Goku, Piccolo, et les autres Z Fighters s'entraînent durement pour affronter cette nouvelle menace. Les combats culminent avec la bataille contre Nappa et Vegeta, où Goku révèle pour la première fois le Kaioken, et les Saiyans montrent leur capacité de transformation en Grands Singes.</p>",
        "images": [
            {
                "url": "/img/sagaSaiyans.jpeg"
            },
            {
                "url": "/img/sagaSaiyans1.jpeg"
            },
            {
                "url": "/img/sagaSaiyans2.jpeg"
            },
            {
                "url": "/img/sagaSaiyans3.jpeg"
            },
            {
                "url": "/img/sagaSaiyans4.jpeg"
            },
            {
                "url": "/img/sagaSaiyans5.jpg"
            },
            {
                "url": "/img/sagaSaiyans6.jpeg"
            },
            {
                "url": "/img/sagaSaiyans7.jpeg"
            }
            ,
            {
                "url": "/img/sagaSaiyans8.jpeg"
            },
            {
                "url": "/img/sagaSaiyans9.jpg"
            }
        ]
    },
    {
        "id": 2,
        "title": "Saga de Namek",
        "summary": "La quête des Dragon Balls sur Namek mène à des affrontements avec les forces de Freezer.",
        "content": "<p>La Saga de Namek débute lorsque Goku et ses amis se rendent sur la planète Namek pour utiliser les Dragon Balls et ressusciter leurs amis morts. Ils y rencontrent Freezer, un tyran intergalactique qui veut également les Dragon Balls pour devenir immortel. Les Z Fighters, y compris Vegeta, s'allient pour affronter les forces de Freezer, menant à une série de batailles épiques. Le combat culmine avec la transformation de Goku en Super Saiyan après la mort de Krillin, et la bataille finale contre Freezer.</p>",
        "images": [
            {
                "url": "/img/sagaNameks.jpeg"
            },
            {
                "url": "/img/sagaNameks1.jpeg"
            },
            {
                "url": "/img/sagaNameks2.jpeg"
            },
            {
                "url": "/img/sagaNameks3.jpeg"
            }
            ,
            {
                "url": "/img/sagaNameks4.jpeg"
            },
            {
                "url": "/img/sagaNameks5.jpeg"
            },
            {
                "url": "/img/sagaNameks6.jpeg"
            }
            ,
            {
                "url": "/img/sagaNameks7.jpeg"
            },
            {
                "url": "/img/sagaNameks8.jpeg"
            }
        ]
    },
    {
        "id": 3,
        "title": "Saga de Freezer",
        "summary": "Goku et ses amis affrontent le tyran Freezer sur Namek dans une bataille décisive pour l'univers.",
        "content": "<p>La Saga de Freezer continue les événements de Namek avec l'intensification du conflit contre Freezer. Ce dernier se transforme à plusieurs reprises, chaque forme augmentant sa puissance. Goku et ses alliés, y compris Vegeta, Piccolo, et Gohan, luttent pour survivre et protéger les habitants de Namek. L'apogée de cette saga est le combat légendaire entre Goku, qui atteint pour la première fois la forme de Super Saiyan, et Freezer, dans une bataille qui secoue toute la planète Namek.</p>",
        "images": [
            {
                "url": "/img/sagaFreezer1.jpeg"
            },
            {
                "url": "/img/sagaFreezer2.jpeg"
            },
            {
                "url": "/img/sagaFreezer3.jpeg"
            }
            ,
            {
                "url": "/img/sagaFreezer4.jpeg"
            },
            {
                "url": "/img/sagaFreezer6.jpeg"
            }
            ,
            {
                "url": "/img/sagaFreezer7.jpeg"
            },
            {
                "url": "/img/sagaFreezer8.jpeg"
            },
            {
                "url": "/img/sagaFreezer9.jpeg"
            }
        ]
    },
    {
        "id": 4,
        "title": "Saga des Androïds",
        "summary": "Des androïdes créés par le Dr. Gero menacent la paix sur Terre.",
        "content": "<p>La Saga des Androïds commence avec l'arrivée de Trunks du futur, qui avertit les Z Fighters de l'imminente attaque des Androïdes, des créatures artificielles créées par le Dr. Gero pour se venger de Goku et ses amis. Les combats contre les Androïdes 17 et 18 montrent leur puissance dévastatrice. La saga s'intensifie avec l'apparition de Cell, un bio-androïde qui absorbe les Androïdes pour atteindre sa forme parfaite. Les Z Fighters doivent trouver un moyen de l'arrêter avant qu'il ne détruise le monde entier.</p>",
        "images": [
            {
                "url": "/img/sagaAndroids.jpeg"
            },
            {
                "url": "/img/sagaAndroids1.jpeg"
            },
            {
                "url": "/img/sagaAndroids2.jpeg"
            },
            {
                "url": "/img/sagaAndroids3.jpeg"
            },
            {
                "url": "/img/sagaAndroids4.jpeg"
            },
            {
                "url": "/img/sagaAndroids5.jpeg"
            },
            {
                "url": "/img/sagaAndroids6.jpeg"
            }

        ]
    },
    {
        "id": 5,
        "title": "Saga de Cell",
        "summary": "Le tournoi des Cell Games met en jeu l'avenir de la Terre contre Cell, le bio-androïde parfait.",
        "content": "<p>La Saga de Cell se concentre sur le tournoi des Cell Games, organisé par Cell après avoir atteint sa forme parfaite en absorbant les Androïdes 17 et 18. Cell défie les Z Fighters et annonce un tournoi pour décider du sort de la Terre. Goku, Gohan, et les autres Z Fighters participent, menant à des combats intenses. Le moment clé est lorsque Gohan atteint le Super Saiyan 2, surpassant son père et détruisant Cell avec une Kamehameha ultime. Cependant, Goku sacrifie sa vie pour sauver la Terre en envoyant Cell dans une autre dimension avant qu'il n'explose.</p>",
        "images": [
            {
                "url": "/img/sagaCell.jpeg"
            },
            {
                "url": "/img/sagaCell1.jpeg"
            },
            {
                "url": "/img/sagaCell2.jpeg"
            },
            {
                "url": "/img/sagaCell3.jpeg"
            },
            {
                "url": "/img/sagaCell4.jpeg"
            },
            {
                "url": "/img/sagaCell5.jpeg"
            },
            {
                "url": "/img/sagaCell6.jpeg"
            },
            {
                "url": "/img/sagaCell7.jpeg"
            },
            {
                "url": "/img/sagaCell8.jpeg"
            }
            ,
            {
                "url": "/img/sagaCell9.jpeg"
            },
            {
                "url": "/img/sagaCell10.jpeg"
            },
            {
                "url": "/img/sagaCell.gif"
            }
        ]
    },
    {
        "id": 6,
        "title": "Saga de Majin Buu",
        "summary": "Le redoutable Majin Buu menace l'univers avec son immense pouvoir de destruction.",
        "content": "<p>La Saga de Majin Buu débute avec la libération de Majin Buu par Babidi, un sorcier maléfique qui souhaite dominer l'univers. Majin Buu, avec ses multiples transformations, devient une menace grandissante pour la Terre et ses habitants. Les Z Fighters, y compris Goku, Vegeta, et leurs enfants, combattent désespérément contre Buu. La saga culmine avec la fusion de Goku et Vegeta en Vegito, et plus tard la transformation de Goku en Super Saiyan 3 pour affronter Kid Buu, la forme originale et la plus puissante de Buu. Goku réussit finalement à détruire Buu avec une Genkidama, restaurant la paix dans l'univers.</p>",
        "images": [
            {
                "url": "/img/sagaBoo.jpeg"
            },
            {
                "url": "/img/sagaBoo1.jpeg"
            },
            {
                "url": "/img/sagaBoo2.jpeg"
            },
            {
                "url": "/img/sagaBoo3.jpeg"
            },
            {
                "url": "/img/sagaBoo4.jpeg"
            },
            {
                "url": "/img/sagaBoo5.jpeg"
            },
            {
                "url": "/img/sagaBoo6.jpeg"
            },
            {
                "url": "/img/sagaBoo7.jpeg"
            },
            {
                "url": "/img/sagaBoo8.jpeg"
            },
            {
                "url": "/img/sagaBoo9.jpeg"
            },
            {
                "url": "/img/sagaBoo10.jpeg"
            }
        ]
    }
]
