[
    {
        "id": 1,
        "title": "Saga des Saiyans",
        "summary": "Les guerriers Saiyans envahissent la Terre, obligeant Goku et ses amis à se battre contre Nappa et Vegeta.",
        "content": "<p>La Saga des Saiyans commence avec l'arrivée de Raditz, le frère de Goku, qui révèle à ce dernier ses origines Saiyanes. Après un combat intense, Raditz est tué, mais pas avant d'avoir envoyé un message à Vegeta et Nappa, deux autres Saiyans, les informant de la présence de puissants guerriers sur Terre. Goku, Piccolo, et les autres Z Fighters s'entraînent durement pour affronter cette nouvelle menace. Les combats culminent avec la bataille contre Nappa et Vegeta, où Goku révèle pour la première fois le Kaio-Ken, et les Saiyans montrent leur capacité de transformation en Grands Singes.</p><h4>Saga des Saiyans (Saiyan Saga)</h4><ul><li>Goku vs. Raditz :</li> <p>Le premier grand combat de *Dragon Ball Z*, où Goku fait équipe avec Piccolo pour affronter son frère aîné Raditz.</p><li>Z Fighters vs. Saibamen :</li> <p>Les combattants Z (Yamcha, Tien, Chiaotzu, Krillin, et Piccolo) affrontent les Saibamen envoyés par Nappa.</p><li>Tien vs. Nappa : </li><p>Tien tente de combattre Nappa pour venger la mort de Chiaotzu.</p><li>Piccolo, Krillin, et Gohan vs. Nappa :</li> <p>Piccolo, Krillin, et Gohan s’allient contre Nappa après la chute de Tien.</p><li>Goku vs. Nappa :</li> <p>Goku arrive juste à temps pour sauver ses amis et affronte Nappa avec sa nouvelle force.</p><li>Goku vs. Vegeta :</li><p> Un des combats les plus emblématiques où Goku utilise le Kaio-Ken et le Genkidama pour combattre Vegeta, qui se transforme en Ōzaru (grand singe).</p></ul>",
        "images": [
            {
                "url": "/img/sagaSaiyans.jpeg"
            },
            {
                "url": "/img/sagaSaiyans1.jpeg"
            },
            {
                "url": "/img/sagaSaiyans2.jpeg"
            },
            {
                "url": "/img/sagaSaiyans3.jpeg"
            },
            {
                "url": "/img/sagaSaiyans4.jpeg"
            },
            {
                "url": "/img/sagaSaiyans5.jpg"
            },
            {
                "url": "/img/sagaSaiyans6.jpeg"
            },
            {
                "url": "/img/sagaSaiyans7.jpeg"
            },
            {
                "url": "/img/sagaSaiyans8.jpeg"
            },
            {
                "url": "/img/sagaSaiyans9.jpg"
            }
        ]
    },
    {
        "id": 2,
        "title": "Saga de Namek",
        "summary": "La quête des Dragon Balls sur Namek mène à des affrontements avec les forces de Freezer.",
        "content": "<p>La Saga de Namek débute lorsque Goku et ses amis se rendent sur la planète Namek pour utiliser les Dragon Balls et ressusciter leurs amis morts. Ils y rencontrent Freezer, un tyran intergalactique qui veut également les Dragon Balls pour devenir immortel. Les Z Fighters, y compris Vegeta, s'allient pour affronter les forces de Freezer, menant à une série de batailles épiques. Le combat culmine avec la transformation de Goku en Super Saiyan après la mort de Krillin, et la bataille finale contre Freezer.</p><h4>Saga de Namek (Namek Saga)</h4><ul><li>Zarbon vs. Vegeta :</li><p>Vegeta affronte Zarbon pour obtenir une Dragon Ball.</p><li>Zarbon (transformé) vs. Vegeta :</li><p>Après sa défaite initiale, Zarbon se transforme et bat Vegeta.</p><li>Vegeta vs. Zarbon (rematch) :</li><p>Vegeta tue Zarbon lors de leur deuxième rencontre.</p><li>Gohan et Krillin vs. Guldo :</li><p> Guldo utilise ses pouvoirs pour retenir Gohan et Krillin jusqu'à ce que Vegeta intervienne.</p><li>Vegeta vs. Recoome :</li> <p>Recoome affronte Vegeta et le blesse gravement.</p><li>Goku vs. Recoome :</li> <p>Goku arrive et neutralise Recoome en un coup.</p><li>Goku vs. Burter et Jeice :</li><p> Goku défait Burter rapidement et force Jeice à fuir.</p><li>Vegeta vs. Jeice :</li><p> Vegeta élimine Jeice après le retour de ce dernier pour se venger.</p><li>Goku vs. Captain Ginyu :</li><p> Goku affronte le capitaine Ginyu, qui échange leurs corps.</p><li>Goku (dans le corps de Ginyu) et Vegeta vs. Captain Ginyu (dans le corps de Goku) :</li><p> Ils travaillent ensemble pour reprendre le corps de Goku.</p><li>Vegeta vs. Captain Ginyu (dans le corps de Ginyu) :</li><p> Ginyu essaie de prendre le corps de Vegeta mais finit dans celui d'une grenouille.</p></ul>",
        "images": [
            {
                "url": "/img/sagaNameks.jpeg"
            },
            {
                "url": "/img/sagaNameks1.jpeg"
            },
            {
                "url": "/img/sagaNameks2.jpeg"
            },
            {
                "url": "/img/sagaNameks3.jpeg"
            },
            {
                "url": "/img/sagaNameks4.jpeg"
            },
            {
                "url": "/img/sagaNameks5.jpeg"
            },
            {
                "url": "/img/sagaNameks6.jpeg"
            },
            {
                "url": "/img/sagaNameks7.jpeg"
            },
            {
                "url": "/img/sagaNameks8.jpeg"
            }
        ]
    },
    {
        "id": 3,
        "title": "Saga de Freezer",
        "summary": "Goku et ses amis affrontent le tyran Freezer sur Namek dans une bataille décisive pour l'univers.",
        "content": "<p>La Saga de Freezer continue les événements de Namek avec l'intensification du conflit contre Freezer. Ce dernier se transforme à plusieurs reprises, chaque forme augmentant sa puissance. Goku et ses alliés, y compris Vegeta, Piccolo, et Gohan, luttent pour survivre et protéger les habitants de Namek. L'apogée de cette saga est le combat légendaire entre Goku, qui atteint pour la première fois la forme de Super Saiyan, et Freezer, dans une bataille qui secoue toute la planète Namek.</p><h4>Saga de Freezer (Frieza Saga)</h4><ul><li>Vegeta, Krillin, et Gohan vs. Freezer (première forme) :</li><p>Les trois combattent ensemble contre Freezer dans sa première forme, mais réalisent rapidement qu'ils ne sont pas de taille face à sa puissance.</p><li>Piccolo (fusionné avec Nail) vs. Freezer (seconde forme) :</li><p>Piccolo arrive sur Namek après avoir fusionné avec Nail, ce qui augmente considérablement sa puissance. Il se bat contre Freezer dans sa seconde forme, tenant tête au tyran pendant un certain temps.</p><li>Piccolo, Gohan, et Krillin vs. Freezer (troisième forme) :</li><p>Freezer se transforme en sa troisième forme, augmentant encore plus sa puissance. Piccolo, Gohan, et Krillin luttent ensemble pour essayer de le contenir, mais sont rapidement dépassés.</p><li>Vegeta vs. Freezer (forme finale) :</li><p>Vegeta, croyant être devenu un Super Saiyan après avoir été soigné par Dende, tente d'affronter Freezer dans sa forme finale. Cependant, il est gravement surpassé par la puissance écrasante de Freezer.</p><li>Goku vs. Freezer (forme finale) :</li><p>Goku entre en scène pour affronter Freezer dans sa forme finale. Après une bataille acharnée, Goku parvient à libérer sa colère et se transforme pour la première fois en Super Saiyan.</p><li>Goku vs. Freezer (forme finale à 100%) :</li><p>Freezer libère toute sa puissance en atteignant 100% de sa forme finale. Le combat atteint son point culminant, avec les deux adversaires se battant à pleine puissance, secouant la planète Namek à chaque échange de coups.</p></ul>",
        "images": [
            {
                "url": "/img/sagaFreezer1.jpeg"
            },
            {
                "url": "/img/sagaFreezer2.jpeg"
            },
            {
                "url": "/img/sagaFreezer3.jpeg"
            },
            {
                "url": "/img/sagaFreezer4.jpeg"
            },
            {
                "url": "/img/sagaFreezer6.jpeg"
            },
            {
                "url": "/img/sagaFreezer7.jpeg"
            },
            {
                "url": "/img/sagaFreezer8.jpeg"
            },
            {
                "url": "/img/sagaFreezer9.jpeg"
            }
        ]
    },
    {
        "id": 4,
        "title": "Saga des Androïds",
        "summary": "Des androïdes créés par le Dr. Gero menacent la paix sur Terre.",
        "content": "<p>La Saga des Androïds commence avec l'arrivée de Trunks du futur, qui avertit les Z Fighters de l'imminente attaque des Androïdes, des créatures artificielles créées par le Dr. Gero pour se venger de Goku et ses amis. Les combats contre les Androïdes 17 et 18 montrent leur puissance dévastatrice. La saga s'intensifie avec l'apparition de Cell, un bio-androïde qui absorbe les Androïdes pour atteindre sa forme parfaite. Les Z Fighters doivent trouver un moyen de l'arrêter avant qu'il ne détruise le monde entier.</p><h4>Saga des Androïdes (Android Saga)</h4><ul><li>Goku vs. Android 19 :</li><p>Goku commence bien le combat contre Android 19, mais il est rapidement affaibli par une maladie cardiaque, le rendant incapable de continuer le combat.</p><li>Vegeta (Super Saiyan) vs. Android 19 :</li><p>Vegeta révèle sa transformation en Super Saiyan pour la première fois et utilise cette nouvelle puissance pour détruire facilement Android 19.</p><li>Vegeta vs. Android 18 :</li><p>Vegeta affronte Android 18, mais malgré ses capacités de Super Saiyan, il est finalement vaincu par l'androïde, montrant la supériorité des Androïdes par rapport aux Z Fighters.</p><li>Piccolo vs. Android 17 :</li><p>Piccolo, après s'être fusionné avec Kami, engage un combat intense contre Android 17 sur une île isolée. Leur bataille se termine sans vainqueur clair avant l'arrivée de Cell.</p></ul>",
        "images": [
            {
                "url": "/img/sagaAndroids.jpeg"
            },
            {
                "url": "/img/sagaAndroids1.jpeg"
            },
            {
                "url": "/img/sagaAndroids2.jpeg"
            },
            {
                "url": "/img/sagaAndroids3.jpeg"
            },
            {
                "url": "/img/sagaAndroids4.jpeg"
            },
            {
                "url": "/img/sagaAndroids5.jpeg"
            },
            {
                "url": "/img/sagaAndroids6.jpeg"
            }
        ]
    },
    {
        "id": 5,
        "title": "Saga de Cell",
        "summary": "Le tournoi des Cell Games met en jeu l'avenir de la Terre contre Cell, le bio-androïde parfait.",
        "content": "<p>La Saga de Cell se concentre sur le tournoi des Cell Games, organisé par Cell après avoir atteint sa forme parfaite en absorbant les Androïdes 17 et 18. Cell défie les Z Fighters et annonce un tournoi pour décider du sort de la Terre. Goku, Gohan, et les autres Z Fighters participent, menant à des combats intenses. Le moment clé est lorsque Gohan atteint le Super Saiyan 2, surpassant son père et détruisant Cell avec une Kamehameha ultime. Cependant, Goku sacrifie sa vie pour sauver la Terre en envoyant Cell dans une autre dimension avant qu'il n'explose.</p><h4>Saga de Cell (Cell Saga)</h4><ul><li>Piccolo (fusionné avec Kami) vs. Imperfect Cell :</li><p>Piccolo affronte Cell après sa fusion avec Kami, et les deux combattent férocement alors que Cell cherche à absorber plus d'énergie pour évoluer.</p><li>Vegeta (Super Saiyan) vs. Semi-Perfect Cell :</li><p>Vegeta, arrogant après avoir atteint une nouvelle puissance en tant que Super Saiyan, laisse Cell atteindre sa forme parfaite, pensant qu'il pourra le vaincre.</p><li>Trunks (Super Saiyan) vs. Perfect Cell :</li><p>Trunks tente de défier Cell après la défaite de Vegeta, mais il se rend compte que sa force accrue n'est pas suffisante pour battre Cell à cause de sa vitesse réduite.</p><li>Goku vs. Perfect Cell :</li><p>Goku affronte Cell dans les Cell Games et montre sa maîtrise du combat, mais finit par abandonner en réalisant qu'il ne peut pas vaincre Cell.</p><li>Gohan (Super Saiyan 2) vs. Cell Juniors :</li><p>Gohan, après s'être transformé en Super Saiyan 2, élimine rapidement les Cell Juniors qui attaquaient les Z Fighters, montrant une puissance immense et sans précédent.</p><li>Gohan (Super Saiyan 2) vs. Perfect Cell :</li><p>Gohan affronte Cell après sa transformation en Super Saiyan 2, prenant le dessus et infligeant des dégâts importants à Cell.</p><li>Gohan (Super Saiyan 2) vs. Super Perfect Cell :</li><p>Après la régénération de Cell en sa forme parfaite améliorée, Gohan, soutenu par l'esprit de Goku, utilise un puissant Kamehameha pour détruire Cell une fois pour toutes.</p></ul>",
        "images": [
            {
                "url": "/img/sagaCell.jpeg"
            },
            {
                "url": "/img/sagaCell1.jpeg"
            },
            {
                "url": "/img/sagaCell2.jpeg"
            },
            {
                "url": "/img/sagaCell3.jpeg"
            },
            {
                "url": "/img/sagaCell4.jpeg"
            },
            {
                "url": "/img/sagaCell5.jpeg"
            },
            {
                "url": "/img/sagaCell6.jpeg"
            },
            {
                "url": "/img/sagaCell7.jpeg"
            },
            {
                "url": "/img/sagaCell8.jpeg"
            },
            {
                "url": "/img/sagaCell9.jpeg"
            },
            {
                "url": "/img/sagaCell10.jpeg"
            },
            {
                "url": "/img/sagaCell.gif"
            }
        ]
    },
    {
        "id": 6,
        "title": "Saga de Majin Buu",
        "summary": "Le redoutable Majin Buu menace l'univers avec son immense pouvoir de destruction.",
        "content": "<p>La Saga de Majin Buu débute avec la libération de Majin Buu par Babidi, un sorcier maléfique qui souhaite dominer l'univers. Majin Buu, avec ses multiples transformations, devient une menace grandissante pour la Terre et ses habitants. Les Z Fighters, y compris Goku, Vegeta, et leurs enfants, combattent désespérément contre Buu. La saga culmine avec la fusion de Goku et Vegeta en Vegito, et plus tard la transformation de Goku en Super Saiyan 3 pour affronter Kid Buu, la forme originale et la plus puissante de Buu. Goku réussit finalement à détruire Buu avec une Genkidama, restaurant la paix dans l'univers.</p><h4>Saga de Majin Buu (Majin Buu Saga)</h4><ul><li>Gohan vs. Dabura :</li><p>Gohan combat le roi des démons, Dabura, dans la base de Babidi. Bien que Gohan ait perdu de sa puissance depuis son combat contre Cell, il parvient à tenir tête à Dabura grâce à sa détermination.</p><li>Vegeta (Majin) vs. Goku (Super Saiyan 2) :</li><p>Sous l'influence de Babidi, Vegeta se transforme en Majin Vegeta et affronte Goku. Ce combat intense oppose deux Super Saiyans 2, révélant leur rivalité inégalée et leur puissance brute. Malgré sa défaite apparente, Goku choisit de ne pas poursuivre le combat pour préserver ses forces.</p><li>Majin Buu vs. Dabura :</li><p>Après avoir été libéré, Majin Buu montre sa puissance en battant facilement Dabura, le roi des démons, prouvant ainsi sa supériorité écrasante.</p><li>Majin Buu vs. Super Saiyan 3 Goku :</li><p>Goku, transformé en Super Saiyan 3 pour la première fois, affronte Majin Buu pour gagner du temps et permettre à Trunks de récupérer le radar Dragon. Leur combat est intense, mais Goku est contraint de partir car son temps sur Terre est limité.</p><li>Majin Buu vs. Majin Vegeta :</li><p>Vegeta, dans un acte de rédemption, se sacrifie en utilisant une attaque explosive massive pour tenter de détruire Majin Buu. Cependant, Buu survit à l'attaque, laissant Vegeta mort et Buu indemne.</p><li>Gotenks vs. Super Buu :</li><p>Dans la salle de l'Esprit et du Temps, Gotenks utilise la fusion pour combattre Super Buu. Bien qu'il montre des techniques impressionnantes et une grande puissance, il ne parvient pas à vaincre Buu.</p><li>Ultimate Gohan vs. Super Buu :</li><p>Après avoir débloqué son potentiel caché grâce à l'entraînement avec le Vieux Kai, Gohan combat Super Buu et prend rapidement l'avantage, surpassant le monstre avec une force incroyable.</p><li>Vegito vs. Super Buu (Gohan absorbé) :</li><p>Goku et Vegeta fusionnent pour former Vegito, un combattant extrêmement puissant, afin d'affronter Super Buu après que ce dernier ait absorbé Gohan. Vegito domine largement le combat, démontrant une puissance immense et des compétences supérieures.</p><li>Super Saiyan 3 Goku et Vegeta vs. Kid Buu :</li><p>Le combat final de la saga voit Goku et Vegeta, aidés par Mr. Satan et les autres Z Fighters, combattre Kid Buu, la forme la plus pure et destructrice de Buu. Après un long combat, Goku utilise une Genkidama alimentée par l'énergie de tous les habitants de la Terre pour détruire Kid Buu, mettant fin à la menace une fois pour toutes.</p></ul>",
        "images": [
            {
                "url": "/img/sagaBoo.jpeg"
            },
            {
                "url": "/img/sagaBoo1.jpeg"
            },
            {
                "url": "/img/sagaBoo2.jpeg"
            },
            {
                "url": "/img/sagaBoo3.jpeg"
            },
            {
                "url": "/img/sagaBoo4.jpeg"
            },
            {
                "url": "/img/sagaBoo5.jpeg"
            },
            {
                "url": "/img/sagaBoo6.jpeg"
            },
            {
                "url": "/img/sagaBoo7.jpeg"
            },
            {
                "url": "/img/sagaBoo8.jpeg"
            },
            {
                "url": "/img/sagaBoo9.jpeg"
            },
            {
                "url": "/img/sagaBoo10.jpeg"
            }
        ]
    }
]